In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
print(data)

[1, 2, 3, 4, 5]

In [4]:
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [13]:
data=[['chandana',10],['madhu',9],['nikhila',8],['fyz',7],['naveen',6]]
df=pd.DataFrame(data,columns=['Name','Marks'])
print(df)

       Name  Marks
0  chandana     10
1     madhu      9
2   nikhila      8
3       fyz      7
4    naveen      6

In [14]:
data=[['chandana',10],['madhu',9],['nikhila',8],['fyz',7],['naveen',6]]
df=pd.DataFrame(data,columns=['Name','Marks'],dtype=float)
print(df)

       Name  Marks
0  chandana   10.0
1     madhu    9.0
2   nikhila    8.0
3       fyz    7.0
4    naveen    6.0

In [15]:
data=[['chandana',10],['madhu',9],['nikhila',8],['fyz',7],['naveen',6]]
df=pd.DataFrame(data,index=['R1','R2','R3','R4','R5'],columns=['Name','Marks'],dtype=float)
print(df)

        Name  Marks
R1  chandana   10.0
R2     madhu    9.0
R3   nikhila    8.0
R4       fyz    7.0
R5    naveen    6.0

In [19]:
data=[['sai','Yes',100,10],['naidu','No',0,9],['nani','Yes',120,8],['boby','Yes',130,7],['baby','No',0,6],['fyz','Yes',200,0],['valli','Yes',140,1]]
df=pd.DataFrame(data,columns=['Name','Rank','Bank_customer','Bank_Balances in Dollar(000)'])
print(df)

    Name Rank  Bank_customer  Bank_Balances in Dollar(000)
0    sai  Yes            100                            10
1  naidu   No              0                             9
2   nani  Yes            120                             8
3   boby  Yes            130                             7
4   baby   No              0                             6
5    fyz  Yes            200                             0
6  valli  Yes            140                             1

In [20]:
data=[['sai','Yes',100,10],['naidu','No',0,9],['nani','Yes',120,8],['boby','Yes',130,7],['baby','No',0,6],['fyz','Yes',200,0],['valli','Yes',140,1]]
df=pd.DataFrame(data,columns=['Name','Bank_customer','Bank_Balances in Dollar(000)','Rank'])
print(df)

    Name Bank_customer  Bank_Balances in Dollar(000)  Rank
0    sai           Yes                           100    10
1  naidu            No                             0     9
2   nani           Yes                           120     8
3   boby           Yes                           130     7
4   baby            No                             0     6
5    fyz           Yes                           200     0
6  valli           Yes                           140     1

In [22]:
df[3:5]

   Name Bank_customer  Bank_Balances in Dollar(000)  Rank
3  boby           Yes                           130     7
4  baby            No                             0     6

In [24]:
df[:4]

    Name Bank_customer  Bank_Balances in Dollar(000)  Rank
0    sai           Yes                           100    10
1  naidu            No                             0     9
2   nani           Yes                           120     8
3   boby           Yes                           130     7

In [27]:
df[::]

    Name Bank_customer  Bank_Balances in Dollar(000)  Rank
0    sai           Yes                           100    10
1  naidu            No                             0     9
2   nani           Yes                           120     8
3   boby           Yes                           130     7
4   baby            No                             0     6
5    fyz           Yes                           200     0
6  valli           Yes                           140     1

In [30]:
df[::]

    Name Bank_customer  Bank_Balances in Dollar(000)  Rank
0    sai           Yes                           100    10
1  naidu            No                             0     9
2   nani           Yes                           120     8
3   boby           Yes                           130     7
4   baby            No                             0     6
5    fyz           Yes                           200     0
6  valli           Yes                           140     1

In [31]:
df[2::4]

    Name Bank_customer  Bank_Balances in Dollar(000)  Rank
2   nani           Yes                           120     8
6  valli           Yes                           140     1

In [34]:
df[::-1]

    Name Bank_customer  Bank_Balances in Dollar(000)  Rank
6  valli           Yes                           140     1
5    fyz           Yes                           200     0
4   baby            No                             0     6
3   boby           Yes                           130     7
2   nani           Yes                           120     8
1  naidu            No                             0     9
0    sai           Yes                           100    10

In [51]:
for a in df:
    
        print(a)

Name
Bank_customer
Bank_Balances in Dollar(000)
Rank

In [107]:
for x in df:
    
    
    print(f"Welcome to all {x}")

Welcome to all Name
Welcome to all Bank_customer
Welcome to all Bank_Balances in Dollar(000)
Welcome to all Rank

In [102]:
x=['lakki','fyz']
for a in x:
    print(f"welcome to ..{a}")

welcome to ..lakki
welcome to ..fyz

In [112]:
a=[[1,'sai',10],[2,'madhu',11]]
df=pd.DataFrame(a,columns=['ID','Name','Rank'])
print(df)

   ID   Name  Rank
0   1    sai    10
1   2  madhu    11

In [113]:
df[0:1]

   ID Name  Rank
0   1  sai    10

In [119]:
df[1:2]

   ID   Name  Rank
1   2  madhu    11

In [120]:
y='fyz'
print(f"Good ni8..{y}")

Good ni8..fyz